# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectLocationSet..::..Erase Method
ProjectLocationSet Class See Also
---
Removes a specified project location from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	ProjectLocation item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As ProjectLocation _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	ProjectLocation^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ProjectLocationThe project location to be erased.
# ### Return Value
The number of project locations that were erased from the set.
# See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace